{
  "sections": [
    {
      "title": "MBBS Admission in Arunachal Pradesh 2025-26, Colleges Seat Matrix, Fee Structure, Application process, cut-off and Counselling"
    },
    {
      "title": "Arunachal Pradesh MBBS Admission 2025-26: Overview",
      "content": [
        {
          "content": "Arunachal Pradesh is a bustling center of industry, innovation, and education, celebrated for its vibrant culture, storied past, and significant economic contributions to India. Its capital."
        },
        {
          "content": "Renowned as a premier destination for medical education in India, Arunachal Pradesh offers a plethora of undergraduate and postgraduate medical programs, drawing students from all corners of the nation. Admission to MBBS programs in Arunachal Pradesh is conducted through the NEET exam, with successful candidates participating in state counseling for enrollment."
        },
        {
          "content": "The MBBS curriculum in Arunachal Pradesh spans 5.5 years, comprising 4.5 years of academic study and 1 year of compulsory internship, providing students with comprehensive training and practical experience.In Arunachal Pradesh aspiring MBBS students have a variety of options available for admission. The state boasts both government and private medical colleges and universities. Typically, securing admission into government medical colleges is more competitive than private ones, resulting in higher cut-off marks for government institutions."
        },
        {
          "content": "The total number of MBBS seats in Arunachal Pradesh can vary each year due to factors such as government policies, changes in infrastructure, and accreditation of new medical colleges. For MBBS Admission Arunachal Pradesh 2025 total 50 seats are available in Government and Private Medical Colleges in Arunachal Pradesh. The state has 0 AIIMS College and 1 Government and 0 Private Medical Colleges."
        },
        {
          "content": "In the following sections, we will delve into the specifics of MBBS admission for the academic year 2025-26 in Arunachal Pradesh including details on college seat matrix, fee structure, application process, cut-off marks, and counseling procedures. For personalized assistance with MBBS admission in India or abroad, feel free to reach out to our dedicated admission counseling team at MBBS APP."
        }
      ]
    },
    {
      "title": "MBBS Admission in Arunachal Pradesh 2025-26: Highlights",
      "content": [
        {
          "content": "Arunachal Pradesh has a total of 1 medical colleges, including 1 government medical colleges, 0 AIIMS (All India Institute of Medical Sciences), 0 central universities, 0 Deemed university and 0 private medical colleges. The government medical colleges offer 50 MBBS seats."
        },
        {
          "table": "<table><tbody><tr><td><strong>Application mode</strong></td><td>Online</td></tr><tr><td><strong>Admission Criteria</strong></td><td>National Entrance Exam</td></tr><tr><td><strong>Entrance Exam</strong></td><td>National Eligibility cum Entrance Test (NEET)</td></tr><tr><td><strong>Examination Authority</strong></td><td>National Testing Agency (NTA)</td></tr><tr><td><strong>Total College Count</strong></td><td>1</td></tr><tr><td><strong>Number of Seats</strong></td><td>MBBS- 50</td></tr><tr><td><strong>Admission Process</strong></td><td>The admission process will be conducted through online counselling by the Directorate of Higher and Technical Education, Arunachal Pradesh.<br> <strong>+91 8</strong><strong>0946-06060</strong></td></tr><tr><td><strong>Rounds of State Counselling</strong></td><td>There will be three Rounds of Counselling for the state quota seats. The first round of counselling will be held in July 2023, the second round in August 2023, and the spot round to be conducted in case of vacancies.</td></tr><tr><td><strong>Selection Criteria</strong></td><td>Candidates will be selected based on their NEET-UG score and the reservation criteria.</td></tr><tr><td><strong>Top MBBS Colleges</strong></td><td>Tomo Riba Institute of Health and Medical Science</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Official Counselling Website Arunachal Pradesh",
      "content": [
        {
          "content": "Official Website: www.apdhte.nic.in"
        }
      ]
    },
    {
      "title": "List of Medical Colleges Arunachal Pradesh",
      "content": [
        {
          "content": "Here in this section we will provide a list of medical(MBBS) colleges in Arunachal Pradesh. In this section college wise Details are available in the form of list. Medical Colleges detailed list is available where you can find complete information about individual college. List of medical colleges along with details as follows:-"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>University Name</strong></td><td><strong>University Name</strong></td><td><strong>Year of Inception of College</strong></td></tr><tr><td>1</td><td><strong>Tomo Riba Institute of Health and Medical Science</strong></td><td>Rajiv Gandhi University</td><td>Government</td><td>2018</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Arunachal Pradesh Medical College Seat Matrix",
      "content": [
        {
          "content": "In this section List of Government medical(MBBS) colleges is provided where you can find the Seat Matrix of Medical colleges. College wise detailed List of Arunachal Pradesh Government medical Colleges along with number of seats is as follows:-"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>Seats</strong></td></tr><tr><td>1</td><td><strong>Tomo Riba Institute of Health and Medical Science</strong></td><td>50</td></tr></tbody></table>"
        },
        {
          "content": "In Arunachal Pradesh there are total 1 Medical Colleges offers MBBS course and accepting NEET UG. Among, these 1 Govt. Medical Colleges (Include 0-AIIMS & 0-JIPMER), 0 are Private Medical Colleges.There are total 50 seats for Arunachal Pradesh MBBS. Amongst, 50 Seats are reserve for Govt. Medical Colleges (Include AIIMS & JIPMER) and 0 seats are reserve for Private Medical Colleges."
        }
      ]
    },
    {
      "title": "Arunachal Pradesh Medical College Fees Structure",
      "content": [
        {
          "content": "Explore the detailed fee structures of Arunachal Pradesh’s medical colleges for 2025 to open the door to your medical education in Arunachal Pradesh. In this section we have provided college wise fee structure of Arunachal Pradesh Medical Colleges. Look for the college information link next to each institution’s name to stay educated, make wise choices, and start your path to a rewarding medical profession. Arunachal Pradesh Medical Colleges Fee Structure for 2025 is given below:-"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>Tuition Fees</strong></td></tr><tr><td>1</td><td><strong>Tomo Riba Institute of Health and Medical Science</strong></td><td>₹ 77100/- (Yearly)</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "College Wise NEET Cutoff (AIQ/SQ) 2023",
      "content": [
        {
          "content": "The NEET cutoff is determined based on various factors such as the number of applicants, the difficulty level of the exam, and the availability of seats in medical and dental colleges. It varies for different categories like General, OBC, SC, ST, and others. Each state and college may also have its own cutoff scores. Generally, higher cutoffs are seen in prestigious colleges and for popular courses. It’s crucial for aspiring medical students to keep track of cutoff trends and prepare accordingly"
        }
      ]
    },
    {
      "title": "Application Form for Arunachal Pradesh MBBS Admission 2025-26",
      "content": [
        {
          "list": "<ul class=wp-block-list><li>All eligible candidates will register Online on www.apdhte.nic.in as per the schedule and remit the notified Registration Fees.</li><li>During online registration, candidates are required to provide/verify information viz. name, Gender, age, State of Domicile, Category, PwD Status, marks of Class XII or equivalent examination etc.</li><li>The candidates will also have to upload relevant documents viz, Category Certificate, Class X certificate, Class XII marksheet, NEET 2023 Rank Card, Photograph, PWD certificate, etc. These will be verified ONLINE.</li><li>All candidates who are found eligible after document verification will be able to fill, change, reorder and delete their choices of courses/institutes as per their preference as per notified schedule. Candidates are advised to LOCK their choices after they are satisfied with their Choice Filling. However, once locked, candidates will not be able to unlock or change the choices.</li><li>Filling of choices for the online counselling will be allowed only once during the scheduled period. Therefore, candidates are advised to fill their choices in this period without fail to be considered for seat allotment in both the rounds.</li><li>Candidates can fill as many choices as they desire.</li><li>If a candidate fails to explicitly lock his/her choices by the stipulated time, his/her last saved choices will be automatically locked after this deadline. Candidates are therefore strongly advised to lock their choices themselves. Candidates MUST TAKE PRINTOUT of their locked choices for future references.</li></ul>"
        }
      ]
    },
    {
      "title": "Registration Fee & Security Deposit for MBBS Admission Arunachal Pradesh 2025-26",
      "content": [
        {
          "content": "The interested candidates desirous of taking part in the Online Counseling has to pay one time Non-refundable registration fee as under at the time of initial registration:-"
        },
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>S.N</th><th data-align=left class=has-text-align-left>Category</th><th data-align=left class=has-text-align-left>REGISTRATION FEE</th></tr><tr><td data-align=left class=has-text-align-left>1</td><td data-align=left class=has-text-align-left><strong>Category – I (APST)</strong></td><td data-align=left class=has-text-align-left>₹ 500/-</td></tr><tr><td data-align=left class=has-text-align-left>2</td><td data-align=left class=has-text-align-left><strong>Category – II (Non-APST)</strong></td><td data-align=left class=has-text-align-left>₹ 700/-</td></tr></tbody></table>"
        },
        {
          "content": "In order to avoid unnecessary blockages of seats till the last date of admission by some of the candidates thereby causing loss of seats, security deposit as detailed shall be levied :"
        },
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>S.N</th><th data-align=left class=has-text-align-left>Course</th><th data-align=left class=has-text-align-left>Security Deposit (in Rs.)</th></tr><tr><td data-align=left class=has-text-align-left>1</td><td data-align=left class=has-text-align-left>MBBS</td><td data-align=left class=has-text-align-left>₹ 5,000/-</td></tr></tbody></table>"
        },
        {
          "content": "The Security Deposit / Seat acceptance fee shall be refunded to the candidates who completes the admission in the allotted institute or withdraws his seat during the window period provided for the purpose. For refund of the Seat Acceptance Fee/Security Deposit, candidates will have to submit documents like admission receipt etc. or proof of withdrawal of seat, as and when notified by this Directorate."
        }
      ]
    },
    {
      "title": "Important Date’s for MBBS Admission Arunachal Pradesh",
      "content": [
        {
          "table": "<table><tbody><tr><th>Event</th><th>Dates</th></tr><tr><td>NEET 2025 Registration</td><td>To be Announced</td></tr><tr><td>NEET 2025 Exam</td><td>To be Announced</td></tr><tr><td>NEET 2025 Result</td><td>To be Announced</td></tr><tr><td>Registration Dates</td><td>To be Announced</td></tr><tr><td>Uploading of Documents</td><td>To be Announced</td></tr><tr><td>Merit List for Eligible Candidates&nbsp;</td><td>To be Announced</td></tr><tr><td>Choice Filling and Locking&nbsp;</td><td>To be Announced</td></tr><tr><td>Seat Allotment List&nbsp;</td><td>To be Announced</td></tr><tr><td>Reporting</td><td>To be Announced</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "MBBS Admission Arunachal Pradesh Eligibility Criteria",
      "content": [
        {
          "list": "<ul class=wp-block-list><li>Passed Class XII (with at least 40% marks) from a Govt. recognized Board with Physics, Chemistry and Biology.</li><li>The minimum age for admission in the various courses will be 17 years as on 31st Dec’ 2023.</li></ul>"
        }
      ]
    },
    {
      "title": "Document Required for MBBS Admission Arunachal Pradesh",
      "content": [
        {
          "content": "Candidates are advised to keep the following documents, (in original along with 03 (Three) sets of self attested photocopies) for submission whenever asked for:"
        },
        {
          "list": "<ul class=wp-block-list><li>APST Certificate for Cat.-I</li><li>Employment Certificate from respective employers or Domicile Certificate<br>issued during 2023 by First Class Magistrate during 2024 for Cat.-II.</li></ul>"
        }
      ]
    },
    {
      "title": "Various Category in MBBS Admission Arunachal Pradesh",
      "content": [
        {
          "content": "The candidates shall be placed in the following 2(Two) categories depending on the criteria as mentioned against each:"
        },
        {
          "table": "<table><tbody><tr><th>S.N</th><th>Category</th><th>Criteria</th></tr><tr><td>1</td><td><strong>Category – I (APST)</strong></td><td>All the APST candidates which also include children of AIS/Central Govt./State Govt. employees belonging to APST</td></tr><tr><td>2</td><td><strong>Category – II (Non-APST)</strong></td><td>Children of Non-APST State Government employees.Children of employees of All India Services/ Central Government organizations &amp; Central Public Sector Undertakings serving within the territory of Arunachal Pradesh.All others, not included in any of the above categories with the condition that the candidate should have passed Class XII or equivalent from any of the schools within Arunachal Pradesh and his/her parent(s) should have been residing in Arunachal Pradesh for atleast the last 3(three) years. Both the criteria should be fulfilled.</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Category Reservation in MBBS Admission Arunachal Pradesh",
      "content": [
        {
          "content": "The distribution of seats will be as per the Reservation Policy of the State for admission to technical / professional institutions as has been notified and / or amended from time to time."
        },
        {
          "content": "As per the Reservation Policy of the State Govt. the distribution of the seats amongst the various categories as mentioned above will be as follows:"
        },
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>Particulars of Reservation Against The Seat</th><th data-align=left class=has-text-align-left>Cat –I</th><th data-align=left class=has-text-align-left>Cat – II</th></tr><tr><td data-align=left class=has-text-align-left><strong>All the regional seats including MBBS</strong></td><td data-align=left class=has-text-align-left>100%</td><td data-align=left class=has-text-align-left>0%</td></tr><tr><td data-align=left class=has-text-align-left><strong>MBBS seats received from Govt. of India and TRIHMS, Arunachal Pradesh</strong></td><td data-align=left class=has-text-align-left>80%</td><td data-align=left class=has-text-align-left>20%</td></tr></tbody></table>"
        }
      ]
    }
 ]}