{
  "sections": [
    {
      "title": "MBBS Admission in Chandigarh 2024-25, Colleges Seat Matrix, Fee Structure, Application process, Cut-off and Counselling"
    },
    {
      "title": "Chandigarh MBBS Admission 2024-25: Overview",
      "content": [
        {
          "content": "Chandigarh is a bustling center of industry, innovation, and education, celebrated for its vibrant culture, storied past, and significant economic contributions to India. Its capital."
        },
        {
          "content": "Renowned as a premier destination for medical education in India, Chandigarh offers a plethora of undergraduate and postgraduate medical programs, drawing students from all corners of the nation. Admission to MBBS programs in Chandigarh is conducted through the NEET exam, with successful candidates participating in state counseling for enrollment."
        },
        {
          "content": "The MBBS curriculum in Chandigarh spans 5.5 years, comprising 4.5 years of academic study and 1 year of compulsory internship, providing students with comprehensive training and practical experience.In Chandigarh aspiring MBBS students have a variety of options available for admission. The state boasts both government and private medical colleges and universities. Typically, securing admission into government medical colleges is more competitive than private ones, resulting in higher cut-off marks for government institutions."
        },
        {
          "content": "The total number of MBBS seats in Chandigarh can vary each year due to factors such as government policies, changes in infrastructure, and accreditation of new medical colleges. For MBBS Admission Chandigarh total 250 seats are available in Government and private Medical Colleges in Chandigarh. The state has 0 AIIMS and 1 Government and 1 Private Medical Colleges."
        },
        {
          "content": "In the following sections, we will delve into the specifics of MBBS admission for the academic year 2024-25 in Chandigarh including details on college seat matrix, fee structure, application process, cut-off marks, and counseling procedures. For personalized assistance with MBBS admission in India or abroad, feel free to reach out to our dedicated admission counseling team at MBBS APP."
        }
      ]
    },
    {
      "title": "MBBS Admission in Chandigarh 2024-25: Highlights",
      "content": [
        {
          "content": "Chandigarh has a total of 2 Medical Colleges, including 1 Government Medical Colleges, 0 AIIMS (All India Institute of Medical Sciences), 0 Deemed University and 1 Private Medical Colleges. The government medical colleges offer 150 MBBS seats, while the private medical colleges offer 100 MBBS seats."
        },
        {
          "table": "<table><tbody><tr><td><strong>Application mode</strong></td><td>Online</td></tr><tr><td><strong>Admission Criteria</strong></td><td>National Entrance Exam</td></tr><tr><td><strong>Entrance Exam</strong></td><td>National Eligibility cum Entrance Test (NEET)</td></tr><tr><td><strong>Examination Authority</strong></td><td>National Testing Agency (NTA)</td></tr><tr><td><strong>Total College Count</strong></td><td>2 (Including Govt &amp; Private)</td></tr><tr><td><strong>Number of Seats</strong></td><td>MBBS- 250 (Including Govt &amp; Private)</td></tr><tr><td><strong>Admission Process</strong></td><td>The admission process will be conducted through online counselling by the State Common Entrance Test Cell – Chandigarh.<br> <strong>+91 8</strong><strong>0946-06060</strong></td></tr><tr><td><strong>Rounds of State Counselling</strong></td><td>There will be Four Rounds of Counselling for the state quota seats. The first round of counselling will be held in July 2023, the second round in August 2023, and the Third &amp; Fourth Round in September 2023.</td></tr><tr><td><strong>Selection Criteria</strong></td><td>Candidates will be selected based on their NEET-UG score and the reservation criteria.</td></tr><tr><td><strong>Top MBBS Colleges</strong></td><td>Government Medical College, Chandigarh</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Official Counselling Website Chandigarh",
      "content": [
        {
          "content": "Official Website: www.gmch.gov.in"
        }
      ]
    },
    {
      "title": "List of Government Medical Colleges Chandigarh",
      "content": [
        {
          "content": "In this section List of Government medical (MBBS) colleges is provided where you can find the establishment year of Medical colleges. Detailed List of Chandigarh Government medical Colleges as follows: –"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>University Name</strong></td><td><strong>Year of Inception of College</strong></td></tr><tr><td>1</td><td>Government Medical College, Chandigarh</td><td>Punjab University</td><td>1991</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "List of Private Medical Colleges Chandigarh",
      "content": [
        {
          "content": "In this section List of Private medical (MBBS) colleges is provided where you can find the establishment year of Medical colleges. Detailed List of Chandigarh Private medical Colleges as follows: –"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>University Name</strong></td><td><strong>Year of Inception of College</strong></td></tr><tr><td>1</td><td>Postgraduate Institute of Medical Education &amp; Research, Chandigarh</td><td>Statutory Autonomous, Chandigarh</td><td>1962</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Chandigarh Government Medical College Seat Matrix",
      "content": [
        {
          "content": "In this section List of Government medical (MBBS) colleges is provided where you can find the Seat Matrix of Medical colleges. College wise detailed List of Chandigarh Government medical Colleges along with number of seats is as follows: –"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>Seats</strong></td></tr><tr><td>1</td><td>Government Medical College, Chandigarh</td><td>150</td></tr></tbody></table>"
        },
        {
          "content": "In Chandigarh there are total 1 Medical Colleges offers MBBS course and accepting NEET UG. Among, these 1 Govt. Medical Colleges (Include 0-AIIMS & 0-JIPMER), 0 are Private Medical Colleges.There are total 150 seats for Chandigarh MBBS. Amongst, 150 Seats are reserve for Govt. Medical Colleges (Include AIIMS & JIPMER) and 0 seats are reserve for Private Medical Colleges."
        }
      ]
    },
    {
      "title": "Chandigarh Private Medical College Seat Matrix",
      "content": [
        {
          "content": "In this section List of Private medical (MBBS) colleges is provided where you can find the Seat Matrix of Medical colleges. College wise detailed List of Chandigarh Private medical Colleges along with number of seats is as follows: –"
        },
        {
          "table": "<table><tbody><tr><td><strong>S.N.</strong></td><td><strong>Name of Medical College</strong></td><td><strong>Seats</strong></td></tr><tr><td>1</td><td>Postgraduate Institute of Medical Education &amp; Research, Chandigarh</td><td>100</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Chandigarh Government Medical College Fees Structure",
      "content": [
        {
          "content": "In this section Fee structure of Chandigarh Government Medical Colleges for 2024-25 is given. Chandigarh Government Medical Colleges Fee Structure vary according to type and status of Institution. College wise fee structure of Government medical colleges of Chandigarh is given below: –"
        },
        {
          "table": "<table><tbody><tr><td>General Category (UT/All India Quota/ PwD category/Central Pool)</td><td>Rs. 24,979/-</td></tr><tr><td>SC including SC (PwD) Category (UT/All India Quota)</td><td>Rs. 19,879/-</td></tr></tbody></table>"
        },
        {
          "content": "Tentative fee structure including admission fee & tuition fee for Foreign Indian Students is as under:"
        },
        {
          "table": "<table><tbody><tr><td><strong>Admission Fee</strong></td><td>Total Charges: US $1,10,000 + US $1,000 registration charges</td></tr><tr><td><strong>Other Annual Fees</strong></td><td>In addition to the above mentioned admission fee, Foreign Indian Students will be charged other fees including tuition fee as applicable to General Category Indian Citizen students admitted in UT Chandigarh Pool. This fee can be paid in Indian rupees also.College security (Refundable) of INR 50,000/- will be charged from Foreign Indian Student at the time of admission which will be refunded after completion of the course.</td></tr></tbody></table>"
        },
        {
          "content": "The above fee structure is subject to revision by Panjab University authorities and same shall be applicable accordingly."
        }
      ]
    },
    {
      "title": "Chandigarh Private Medical College Fees Structure",
      "content": [
        {
          "content": "In this section Fee structure of Chandigarh Private Medical Colleges for 2024-25 is given. Chandigarh Private Medical Colleges Fee Structure vary according to type and facilities of Institution. College wise fee structure of Private medical colleges of Chandigarh is given below: –"
        },
        {
          "table": "<table><tbody><tr><td><strong>SN</strong></td><td><strong>&nbsp;College/University</strong></td><td data-align=left class=has-text-align-left><strong>Total Fee</strong></td></tr><tr><td>1.</td><td>Postgraduate Institute of Medical Education &amp; Research, Chandigarh</td><td data-align=left class=has-text-align-left>–</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "College Wise NEET Cutoff (AIQ/SQ) 2023",
      "content": [
        {
          "content": "The NEET cutoff is determined based on various factors such as the number of applicants, the difficulty level of the exam, and the availability of seats in medical and dental colleges. It varies for different categories like General, OBC, SC, ST, and others. Each state and college may also have its own cutoff scores. Generally, higher cutoffs are seen in prestigious colleges and for popular courses. It’s crucial for aspiring medical students to keep track of cutoff trends and prepare accordingly"
        }
      ]
    },
    {
      "title": "MBBS Admission Chandigarh: College Wise Cut-off (Rank)",
      "content": [
        {
          "content": "To get into the MBBS programs at Chandigarh prestigious medical colleges, you need to know the college-specific cut-offs (ranks). The minimum score needed to get into each college is set by these cut-offs, which are usually made public after the National Eligibility Entrance Test (NEET) results."
        },
        {
          "table": "<table><tbody><tr><td><strong>College Name</strong></td><td><strong>General</strong></td><td><strong>SC</strong></td><td><strong>ST</strong></td></tr><tr><td><strong>NEET Rank</strong></td><td><strong>NEET Scores</strong></td><td><strong>NEET Rank</strong></td><td><strong>NEET Scores</strong></td><td><strong>NEET Rank</strong></td><td><strong>NEET Scores</strong></td></tr><tr><td>Government Medical College and Hospital, Chandigarh</td><td>776</td><td>680</td><td>16444</td><td>608</td><td>14498</td><td>612</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Top Government MBBS Colleges in Chandigarh",
      "content": [
        {
          "content": "In this section we provide a list of Best Government medical (MBBS) colleges in Chandigarh based on feedback of admitted students, Infrastructure of Medical college, Faculty, hostel facility, Ranking and Cut-off. It will help students to Choose a list of Top|Best Government medical (MBBS) colleges in Chandigarh NEET Counselling. List of Top|Best Government medical (MBBS) colleges in Chandigarh as follows: –"
        },
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>S.N</th><th data-align=left class=has-text-align-left>College Name</th><th data-align=left class=has-text-align-left>City</th></tr><tr><td data-align=left class=has-text-align-left>1</td><td data-align=left class=has-text-align-left>Government Medical College, Chandigarh</td><td data-align=left class=has-text-align-left>Chandigarh</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Top Private MBBS Colleges in Chandigarh",
      "content": [
        {
          "content": "In this section we provide a list of Best Private medical (MBBS) colleges in Chandigarh based on feedback of admitted students, Infrastructure of Medical college, Faculty, hostel facility, Ranking and Cut-off. It will help students to Choose a list of Top|Best Private medical (MBBS) colleges in Chandigarh NEET Counselling. List of Top|Best Private medical (MBBS) colleges in chandigarh as follows: –"
        },
        {
          "table": "<table><tbody><tr><th>S.N.</th><th>College Name</th><th>City</th></tr><tr><td>1</td><td>Postgraduate Institute of Medical Education &amp; Research, Chandigarh</td><td>Chandigarh</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Application Form for Chandigarh MBBS Admission 2024-25",
      "content": [
        {
          "list": "<ul class=wp-block-list><li>The application form must be filled out entirely online. Only online application fees are accepted from students.</li><li>The MBBS Admission Chandigarh Application Form is now available, and candidates can submit their applications till the deadline.</li><li>In order to register for the Chandigarh MBBS 2024 application form, applicants must input their personal, academic, NEET 2024 score, and other information. The authority will announce the merit ranking and adhere to the procedure of document verification, choice-filling, and place-allocation.</li><li>Candidates must bring a hard copy of their admissions application along with all Original Documents when they report to the designated medical or dental college; otherwise, their application will be rejected/disqualified without further communication.</li></ul>"
        }
      ]
    },
    {
      "title": "Application Fees & Security Deposit for MBBS Admission Chandigarh 2024-25",
      "content": [
        {
          "content": "Application fees for NEET UG Counselling can be paid online through the official website of Directorate of Medical Education & Research Chandigarh during the registration window for each counselling round. Category wise application fee for Chandigarh NEET UG Counselling is as follows:"
        },
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>Particular</th><th data-align=left class=has-text-align-left>General &amp; other categories</th><th data-align=left class=has-text-align-left>SC category</th><th data-align=left class=has-text-align-left>Foreign Indian Student / NRI<br>Category</th></tr><tr><td data-align=left class=has-text-align-left><strong>Application Fee</strong></td><td data-align=left class=has-text-align-left>2,000/- + Bank Charges, if any</td><td data-align=left class=has-text-align-left>1000/- + Bank Charges, if any</td><td data-align=left class=has-text-align-left>14,000/- + Bank Charges, if any</td></tr></tbody></table>"
        },
        {
          "content": "Note- This fee can be paid online through the official website of Directorate of Medical Education & Research Chandigarh during the registration window for each counselling round."
        },
        {
          "content": "The security deposit in Chandigarh NEET UG Counselling serves various purposes. It ensures a fair, effective, and financially sustainable process for a larger range of qualified applicants by discouraging seat blocking, encouraging commitment and thwarting fraud. This financial commitment benefits everyone in the long run by preserving an open and trustworthy system for medical college admissions. Details of Security deposit is as follows: -Application fees for NEET UG Counselling can be paid online through the official website of Directorate of Medical Education & Research Chandigarh during the registration window for each counselling round. Category wise application fee for Chandigarh NEET UG Counselling is as follows:"
        },
        {
          "table": "<table><tbody><tr><th>Item</th><th>Fee</th><th>Remark</th></tr><tr><td><strong>Security Money</strong></td><td>50,000/-</td><td>&nbsp;Indian Student at the time of admission which will be refunded after completion of the course.</td></tr></tbody></table>"
        },
        {
          "content": "Note:- Please note that application fees and Security money can vary, and the details are usually provided in the official information bulletin or notification released by the relevant authorities. Make sure to refer to the latest official documents or contact the concerned authorities directly for the most accurate information."
        }
      ]
    },
    {
      "title": "Important Date’s for MBBS Admission Chandigarh",
      "content": [
        {
          "table": "<table><tbody><tr><th data-align=left class=has-text-align-left>Event</th><th data-align=left class=has-text-align-left>Dates</th></tr><tr><td data-align=left class=has-text-align-left>Availability of Application Form</td><td data-align=left class=has-text-align-left>August 09 – August 16, 2024</td></tr><tr><td data-align=left class=has-text-align-left>Publication of Provisional Merit List</td><td data-align=left class=has-text-align-left>August 21, 2024</td></tr><tr><td data-align=left class=has-text-align-left>Publication of Final Merit List</td><td data-align=left class=has-text-align-left>August 24, 2024</td></tr></tbody></table>"
        }
      ]
    },
    {
      "title": "Application Process for MBBS Admission Chandigarh",
      "content": []
    },
    {
      "title": "MBBS Admission Chandigarh Eligibility Criteria",
      "content": [
        {
          "list": "<ul class=wp-block-list><li>The candidate must be an Indian National.</li><li>The candidate must be registered online application on website of State.</li><li>Indian Citizen</li><li>Overseas Citizen of India (OCI) Candidate will be eligible for Government / Corporation / Government Aided / Private unaided college for academic year 2024-25.</li><li>Those who want to apply must have a 10+2 in the science stream from a recognized board.</li><li>Those who want to apply for Chandigarh MBBS Admission must have taken Biology as a required course and have a minimum of 50% overall marks.</li><li>Those who want to apply must take the NEET Exam. From the 2023–24 academic year on, there is no upper age limit to take the NEET exam.</li></ul>"
        }
      ]
    },
    {
      "title": "Document Required for MBBS Admission Chandigarh",
      "content": [
        {
          "list": "<ul class=wp-block-list><li>Score Sheet for NEET 2023</li><li>NEET Admission Ticket</li><li>Letter of Assignment</li><li>12th class card and passing certificate</li><li>Grade Card and Passing Certificate for Grade 10</li><li>All grade reports for classes 11 and 12, if they were passed in more than one attempt.</li><li>A copy of a photo identification card, such as a driver’s licence, PAN card, electoral card, government or public utility card, school ID card, or Aadhar card.</li><li>Valid caste certificate, sub-category certificate, if applicable</li><li>Certificate of domicile, if applicable</li><li>4 passport size photographs same as affixed on application form</li><li>Character certification from the previous study institution</li><li>Migration Certificate from the previous study institution</li><li>The MBBS admission process in Chandigarh is a competitive one, but it is also a fair one. All candidates who meet the eligibility criteria have a chance to be admitted to a medical college in the state.</li></ul>"
        }
        
      ]
    }

  ]
}